var names = new Array('Георгий Брагин', 
		'Яков Гущин', 'Ростислав Кириллов', 
		'Александр Колесников', 'Иван Гурьев', 
		'Степан Копылов', 'Виктор Макаров', 
		'Олег Комиссаров', 'Александр Станкевич', 
		'Эльдар Джарахов', 'Павел Шиколай', 
		'Ваня Колячко', 'Дминтрий Яковчик', 
		'Артём Вашкевич', 'Коля Дадаев', 
		'Дима Чаботько' , 'Ваня Шавела', 
		'Женя Эйсмонт', 'Миша Волков');
	var cities = new Array('Лида', 'Минск', 'Гродно', 
			'Могилёв', 'Гомель', 'Витебск', 'Воложин', 
			'Каллифея', 'Калмунай' ,'Калукан', 'Калулуши', 
			'Калькутта', 'Кальмар', 'Кальяри', 'Камагуэй', 
			'Камбиа', 'Каменец-Подольский', 'Камник',
			'Кампала', 'Кампинас', 'Кампонгспы', 'Кампонгтхом', 
			'Кампонгтям');
		n = names.length; 


	var people = new Array(n); 

	for(var i = 0; i<n; i++)
	{ 
		people[i] =
		{ 
			name : names[i], 
			city : cities[Math.floor(Math.random() * cities.length)], 
			age : Math.floor(Math.random()*(100-20)+20), 
		} 
			
	} 
	people.sort(function(a,b)
			{ 
			return b.age - a.age; 
			}) 
	for(var i = 0; i<n; i++)
		document.writeln(people[i].name + "-" + people[i].city + "-" + people[i].age );